Show / Hide Table of Contents
Class GrpcReflectionClient
Client for the GrpcReflectionMessageHandler enabled GrpcClient
Inheritance
System.Object
GrpcReflectionClient
GrpcServiceBasedReflectionClient<IReflectionService>
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionClient
Constructors
Improve this Doc   View Source
GrpcReflectionClient(String, Int32)
Initializes the GrpcReflectionClient
Declaration
public GrpcReflectionClient(string clientId, int port)
Parameters
 Type |  Name |  Description
 System.String |  clientId
ID of the client.
 System.Int32 |  port
Port on which GrpcServer is running.
Properties
Improve this Doc   View Source
IsConnected
Determines whether the client is connected.
Declaration
public bool IsConnected { get; }
Property Value
 Type |  Description
 System.Boolean
Methods
Improve this Doc   View Source
ConnectAsync()
Connects the client to the server.
Declaration
public Task ConnectAsync()
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
DisconnectAsync()
Disconnects client from the server.
Declaration
public Task DisconnectAsync()
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
InvokeMethod(Type, String, Object[])
Declaration
public object InvokeMethod(Type returnType, string methodName, params object[] arguments)
Parameters
 Type |  Name |  Description
 System.Type |  returnType
 System.String |  methodName
 System.Object[] |  arguments
Returns
 Type |  Description
 System.Object
Improve this Doc   View Source
InvokeMethod<T>(String, Object[])
Invokes remote method over Grpc via reflection.
Declaration
public T InvokeMethod<T>(string methodName, params object[] arguments)
Parameters
 Type |  Name |  Description
 System.String |  methodName
Name of the method to invoke.
 System.Object[] |  arguments
Arguments with which the method will be called.
Returns
 Type |  Description
 T
Type Parameters
 Name |  Description
 T
Type to which the result will be converted.
 Improve this Doc
 View Source